# UndefinedFluidUnit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConversionFailures..::..UndefinedFluidUnit Property
BuiltInFailures..::..ConversionFailures Class See Also
---
Undefined fluid unit: '[Fluid Unit Type Name]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UndefinedFluidUnit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UndefinedFluidUnit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UndefinedFluidUnit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConversionFailures Class
Autodesk.Revit.DB Namespace